{
  "definitions": {
    "threat": "A potential cause of an unwanted incident (something that could do harm).",
    "vulnerability": "A weakness that can be exploited (a bug, misconfiguration, missing control).",
    "exploit": "A technique or code that uses a vulnerability.",
    "risk": "Likelihood × impact of a threat exploiting a vulnerability.",
    "malware": "Software designed to harm computer systems, networks, or data.",
    "ransomware": "Malware that encrypts or locks data/systems to extort payment for restoration.",
    "spyware": "Software that secretly monitors user activity and collects information.",
    "social engineering": "Manipulating people into revealing confidential information or performing actions.",
    "phishing": "A social engineering attack that uses email or fraudulent websites to steal credentials.",
    "pretexting": "A social engineering technique where an attacker creates a false scenario to obtain information.",
    "sql injection": "An application attack that abuses unsanitized input to execute malicious SQL queries against a database.",
    "xss": "Cross-Site Scripting - an attack that injects malicious scripts into web pages viewed by other users.",
    "dos": "Denial of Service - an attack that disrupts services by overwhelming them with traffic.",
    "mfa": "Multi-Factor Authentication - a security method requiring multiple forms of verification.",
    "least privilege": "A security principle where users and services receive only the minimum access necessary.",
    "network segmentation": "Dividing networks into smaller, isolated segments to limit lateral movement.",
    "dmz": "Demilitarized Zone - a segmented network zone used to host public-facing services while protecting the internal network.",
    "defense in depth": "A security strategy using multiple layers of controls so a single failure doesn't lead to compromise.",
    "zero trust": "A security model that assumes breach and verifies explicitly with identity, device, and context signals.",
    "backup": "A copy of data or system state used to restore availability and integrity after loss, corruption, or ransomware.",
    "security control": "A safeguard (policy, process, or technology) used to reduce risk by preventing, detecting, or correcting security events.",
    "technical control": "A control implemented through technology (hardware/software), such as configuration settings, encryption, or firewall rules.",
    "managerial control": "A control implemented through management direction—policies, standards, procedures, and governance (often called administrative controls).",
    "administrative control": "Another name for a managerial control—policies, standards, procedures, and oversight that guide secure behavior.",
    "operational control": "A control implemented by people and routine processes, such as guard patrols, awareness training, or incident handling procedures.",
    "physical control": "A tangible control that limits physical access to facilities or equipment, such as locks, fences, lighting, or badge readers.",
    "preventive control": "A control designed to stop an unwanted event from happening (or block access) before impact occurs.",
    "deterrent control": "A control designed to discourage an attacker by increasing perceived risk or consequences (doesn't necessarily block the action).",
    "detective control": "A control designed to discover or alert on events that have occurred or are occurring, enabling investigation and response.",
    "corrective control": "A control used after detection to reduce impact, restore systems, or return operations to a known-good state.",
    "compensating control": "An alternate control used when a primary control isn't feasible, providing equivalent or temporary risk reduction.",
    "directive control": "A control that directs behavior (signs, guidelines, training). It relies on compliance rather than enforcement.",
    "firewall": "A system that filters network traffic based on rules to allow, block, or log connections.",
    "antivirus": "Software that detects, blocks, and removes malicious code (malware) on endpoints.",
    "security policy": "High-level management statement that defines security objectives and expectations (the 'what' and 'why').",
    "standard operating procedure": "Step-by-step instructions describing how to perform a routine task consistently (often shortened to SOP).",
    "separation of duties": "A control where responsibilities are split among multiple people to reduce fraud, error, or abuse by any single individual.",
    "motion detector": "A sensor that triggers an alert when movement is detected in a monitored area.",
    "badge reader": "An access control device that grants entry based on a credential (badge/card) presented by a user.",
    "log review": "The process of examining system/application logs to detect anomalies, incidents, or policy violations.",
    "access control": "Mechanisms and policies that determine who/what can access a resource and under what conditions.",
    "login banner": "A message displayed before access is granted that warns users and establishes monitoring/authorized-use terms (often used as a deterrent)."
  }
}