{
  "definitions": {
    "security control": "A safeguard or countermeasure used to reduce risk to systems, data, or people.",
    "assets": "Anything of value to an organization, including data, systems, facilities, and personnel.",
    "threat": "Any circumstance or event with the potential to negatively impact systems or data.",
    "security incident": "An event that compromises confidentiality, integrity, or availability of information or systems.",
    "defense in depth": "A layered security strategy that uses multiple controls to protect assets.",
    "technical controls": "Security safeguards implemented using technology such as software and hardware.",
    "managerial controls": "Administrative safeguards based on policies, procedures, and governance.",
    "operational controls": "Safeguards implemented by people and organizational processes.",
    "physical controls": "Safeguards that protect physical facilities and equipment.",
    "preventive controls": "Controls designed to stop incidents before they occur.",
    "deterrent controls": "Controls designed to discourage attacks by increasing perceived risk.",
    "detective controls": "Controls that identify or alert when an incident occurs.",
    "corrective controls": "Controls that reduce damage and restore systems after incidents.",
    "compensating controls": "Alternative controls used when primary safeguards cannot be implemented.",
    "directive controls": "Controls that instruct or guide user behavior toward secure practices.",
	"technical control": "A security safeguard implemented using technology such as software and hardware.",
    "managerial control": "An administrative safeguard based on policies, procedures, and governance.",
    "operational control": "A safeguard implemented by people and organizational processes.",
    "physical control": "A safeguard that protects physical facilities and equipment.",
    "preventive control": "A control designed to stop incidents before they occur.",
    "deterrent control": "A control designed to discourage attacks by increasing perceived risk.",
    "detective control": "A control that identifies or alerts when an incident occurs.",
    "corrective control": "A control that reduce damage and restore systems after incidents.",
    "compensating control": "An alternative control, used when primary safeguards cannot be implemented.",
    "directive control": "A control that instructs or guides user behavior toward secure practices.",
	"cia triad": "A security model consisting of confidentiality, integrity, and availability.",
    "confidentiality": "Ensuring information is accessible only to authorized parties.",
    "integrity": "Ensuring information is accurate and has not been altered without authorization.",
    "availability": "Ensuring systems and data are accessible when needed.",
    "authenticity": "Ensuring data is authentic.",
    "non-repudiation": "The ability to prove that a specific action was performed by a particular entity.",
    "digital signature": "A cryptographic mechanism used to verify authenticity and integrity of data.",
    "authentication factor": "A category of credentials used to verify identity, such as knowledge, possession, or biometrics.",
    "authorization": "The process of granting or denying access to resources.",
    "accounting": "The process of tracking and recording user and system activity.",
    "zero trust": "A security model that requires continuous verification of all users and devices.",
    "honeypot": "A decoy system designed to attract and analyze attacker behavior.",
	"change management": "A structured process for controlling and approving modifications to systems and infrastructure.",
    "rollback plan": "A predefined method for restoring systems if a change fails.",
    "configuration management": "The practice of maintaining consistent system settings across environments.",
    "version control system": "A tool used to track and manage changes to files over time.",
    "change advisory board": "A group responsible for reviewing and approving significant system changes.",
	"cryptography": "The practice of protecting information using mathematical algorithms.",
    "public key infrastructure": "A framework that manages digital certificates and public key encryption.",
    "certificate authority": "An entity that verifies identities and issues digital certificates.",
    "symmetric encryption": "Encryption using the same key for both encryption and decryption.",
    "asymmetric encryption": "Encryption using a public and private key pair.",
    "hardware security module": "A tamper-resistant device used to store cryptographic keys and perform encryption.",
    "trusted platform module": "A hardware component that provides secure storage and integrity verification.",
    "secure enclave": "An isolated execution environment for sensitive computations.",
    "tokenization": "Replacing sensitive data with non-sensitive tokens.",
    "data masking": "Hiding portions of data while keeping its format.",
    "steganography": "Hiding data inside other files or media.",
    "hash function": "An algorithm that converts data into a fixed-length digest.",
    "hash collision": "When two different inputs produce the same hash value.",
    "digital certificate": "A file that binds a public key to an identity.",
    "certificate revocation": "The process of invalidating a digital certificate before expiration.",
	"threat actor": "An individual or group that attempts to exploit vulnerabilities to gain unauthorized access.",
	"threat actors": "Individuals or groups that attempt to exploit vulnerabilities to gain unauthorized access.",
    "nation-state actor": "A government-backed group conducting cyber operations to advance national interests.",
    "organized crime": "Criminal groups conducting cyberattacks primarily for financial gain.",
    "hacktivist": "An attacker motivated by political or ideological beliefs rather than profit motives.",
	"hacktivists": "Attackers motivated primarily by political or ideological beliefs rather than profit motives.",
    "insider threat": "Security risk originating from individuals with legitimate system access.",
    "shadow it": "Use of unapproved technology or services without organizational oversight.",
    "espionage": "The act of obtaining sensitive information for strategic advantage.",
    "data exfiltration": "Unauthorized transfer of data from an organization’s systems.",
	"attack vector": "The method or pathway used by an attacker to gain access to a system.",
    "attack surface": "All possible points where an attacker could attempt to enter or extract data.",
    "phishing": "A social engineering technique that uses deceptive messages to obtain sensitive information.",
    "business email compromise": "A fraud scheme using impersonated business emails to request money or data.",
    "watering hole attack": "An attack that infects websites frequently visited by a specific group of targets.",
    "supply chain attack": "An attack that compromises vendors or software providers to reach customers indirectly.",
	"vulnerability": "A weakness that can be exploited to compromise security.",
    "memory injection": "Insertion of malicious code into a running process.",
    "race condition": "A flaw caused by timing-dependent behavior.",
	"memory injection": "Execution of malicious code inside the memory of a running process.",
    "buffer overflow": "An attack where more data is written to a buffer than it can hold, causing data to 'spill over' into adjacent buffers.",
    "race condition": "A flaw caused by timing-dependent system behavior.",
    "sql injection": "Exploitation of unsafe database query construction.",
    "cross-site scripting": "Injection of malicious scripts into web pages viewed by others.",
    "zero-day vulnerability": "A vulnerability unknown to vendors with no available patch.",
	"malware": "Software designed to disrupt operations, steal data, or gain unauthorized access.",
    "ransomware": "Malware that encrypts data and demands payment for recovery.",
    "botnet": "A group of infected systems remotely controlled by an attacker.",
    "dns tunneling": "Using DNS queries to covertly transmit data.",
	"replay attack": "An attack that reuses captured authentication or transaction data.",
    "indicator of compromise": "Observable evidence suggesting malicious activity.",
    "credential stuffing": "Automated reuse of leaked credentials across services."
	"segmentation": "Dividing systems or networks into isolated zones to limit attack spread.",
    "least privilege": "Granting only the minimum access necessary to perform a task.",
    "configuration baseline": "A defined set of secure system settings used as a compliance standard.",
    "infrastructure as code": "Managing system configurations using version-controlled templates."
  }
}