{
  "title": "System Hardening",
  "blocks": [
    {
      "type": "heading",
      "text": "System Hardening"
    },
    {
      "type": "paragraph",
      "text": "System hardening is the process of reducing a system’s attack surface by removing or securing anything that is not required for the system to perform its function. In practice, hardening is about making the default state of a system more resistant to compromise. Many breaches succeed because systems were deployed quickly with convenience-oriented defaults and were never tightened afterward."
    },
    {
      "type": "paragraph",
      "text": "Hardening begins with understanding purpose. A database server has a different required feature set than a web server, and both differ from user workstations. When you harden systems, you intentionally disable unnecessary services, remove unneeded software components, and restrict network exposure to only the ports and protocols that must be reachable. Every extra service running is one more piece of code that could contain vulnerabilities."
    },
    {
      "type": "paragraph",
      "text": "Authentication and authorization settings are central to hardening. Strong password policies, multi-factor authentication for privileged access, and strict account management reduce the chance that attackers can gain a foothold using stolen or guessed credentials. Hardening also includes limiting administrative access paths, such as disabling direct remote administration from untrusted networks and requiring secure jump hosts or VPN access."
    },
    {
      "type": "paragraph",
      "text": "Logging and monitoring are often overlooked in hardening discussions, but they are critical. A hardened system should produce useful security logs and forward them to a central location so attackers cannot easily erase evidence by tampering with local logs. Hardening also includes configuring alerting, such as notifying administrators when privileged accounts log in, when sensitive configuration changes occur, or when unexpected services start."
    },
    {
      "type": "paragraph",
      "text": "Hardening is most effective when standardized. Organizations typically define secure build standards, sometimes called golden images, and deploy systems from those templates. This approach reduces configuration drift and ensures that every deployed system starts from a known secure baseline. However, hardening is not permanent; systems evolve, software updates introduce new settings, and business needs change. Continuous compliance checks and periodic reviews ensure hardened states remain consistent."
    }
  ]
}